
### :heavy_check_mark: Terraform Format and Style 🎨
<details><summary>Logs</summary>
Output
```diff

```
Errors
```

```
</details> <!-- End Format Logs -->
### :heavy_check_mark: Terraform Initialization ⚙️
<details><summary>Logs</summary>
Output
```

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Finding hashicorp/aws versions matching "~> 3.66.0"...
- Installing hashicorp/aws v3.66.0...
- Installed hashicorp/aws v3.66.0 (signed by HashiCorp)

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m

```
Errors
```

```
</details> <!-- End Init Logs -->
### :heavy_check_mark: Terraform Validation 🤖
<details><summary>Logs</summary>
Output
```+
Success! The configuration is valid.


```
Errors
```

```
</details> <!-- End Validate Logs -->
### :heavy_check_mark: Terraform Plan 📖
<details><summary>Logs</summary>
```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_elastic_beanstalk_application.tftest will be created
  + resource "aws_elastic_beanstalk_application" "tftest" {
      + arn         = (known after apply)
      + description = "Image Manager"
      + id          = (known after apply)
      + name        = "ImageManager"
      + tags_all    = (known after apply)
    }

  # aws_elastic_beanstalk_application_version.default will be created
  + resource "aws_elastic_beanstalk_application_version" "default" {
      + application  = "ImageManager"
      + arn          = (known after apply)
      + bucket       = (known after apply)
      + description  = "application version created by terraform"
      + force_delete = false
      + id           = (known after apply)
      + key          = (known after apply)
      + name         = "ImageManager"
      + tags_all     = (known after apply)
    }

  # aws_elastic_beanstalk_environment.tfenvtest will be created
  + resource "aws_elastic_beanstalk_environment" "tfenvtest" {
      + all_settings           = (known after apply)
      + application            = "ImageManager"
      + arn                    = (known after apply)
      + autoscaling_groups     = (known after apply)
      + cname                  = (known after apply)
      + cname_prefix           = (known after apply)
      + endpoint_url           = (known after apply)
      + id                     = (known after apply)
      + instances              = (known after apply)
      + launch_configurations  = (known after apply)
      + load_balancers         = (known after apply)
      + name                   = "image-manager"
      + platform_arn           = (known after apply)
      + queues                 = (known after apply)
      + solution_stack_name    = "64bit Amazon Linux 2 v4.2.8 running Tomcat 8.5 Corretto 8"
      + tags                   = {
          + "Environment" = "test"
        }
      + tags_all               = {
          + "Environment" = "test"
        }
      + tier                   = "WebServer"
      + triggers               = (known after apply)
      + version_label          = (known after apply)
      + wait_for_ready_timeout = "20m"

      + setting {
          + name      = "IamInstanceProfile"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "aws-elasticbeanstalk-ec2-instance-profile"
        }
      + setting {
          + name      = "InstanceType"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "t3.medium"
        }
      + setting {
          + name      = "LoadBalancerType"
          + namespace = "aws:elasticbeanstalk:environment"
          + value     = "application"
        }
      + setting {
          + name      = "MinSize"
          + namespace = "aws:autoscaling:asg"
          + value     = "2"
        }
    }

  # aws_iam_instance_profile.aws-elasticbeanstalk-ec2-instance-profile will be created
  + resource "aws_iam_instance_profile" "aws-elasticbeanstalk-ec2-instance-profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "aws-elasticbeanstalk-ec2-instance-profile"
      + path        = "/"
      + role        = "aws-elasticbeanstalk-ec2-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_policy_attachment.aws-elasticbeanstalk-ec2-attach-EB will be created
  + resource "aws_iam_policy_attachment" "aws-elasticbeanstalk-ec2-attach-EB" {
      + id         = (known after apply)
      + name       = "test-attachment-1"
      + policy_arn = "arn:aws:iam::aws:policy/AWSElasticBeanstalkWebTier"
      + roles      = [
          + "aws-elasticbeanstalk-ec2-role",
        ]
    }

  # aws_iam_policy_attachment.aws-elasticbeanstalk-ec2-attach-EC2 will be created
  + resource "aws_iam_policy_attachment" "aws-elasticbeanstalk-ec2-attach-EC2" {
      + id         = (known after apply)
      + name       = "test-attachment-1"
      + policy_arn = "arn:aws:iam::aws:policy/AmazonS3ReadOnlyAccess"
      + roles      = [
          + "aws-elasticbeanstalk-ec2-role",
        ]
    }

  # aws_iam_policy_attachment.aws-elasticbeanstalk-ec2-attach-S3 will be created
  + resource "aws_iam_policy_attachment" "aws-elasticbeanstalk-ec2-attach-S3" {
      + id         = (known after apply)
      + name       = "test-attachment-1"
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ReadOnlyAccess"
      + roles      = [
          + "aws-elasticbeanstalk-ec2-role",
        ]
    }

  # aws_iam_policy_attachment.aws-elasticbeanstalk-ec2-attach-SSM will be created
  + resource "aws_iam_policy_attachment" "aws-elasticbeanstalk-ec2-attach-SSM" {
      + id         = (known after apply)
      + name       = "test-attachment-1"
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2RoleforSSM"
      + roles      = [
          + "aws-elasticbeanstalk-ec2-role",
        ]
    }

  # aws_iam_role.aws-elasticbeanstalk-ec2-role will be created
  + resource "aws_iam_role" "aws-elasticbeanstalk-ec2-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aws-elasticbeanstalk-ec2-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_s3_bucket.bucket-s3-app will be created
  + resource "aws_s3_bucket" "bucket-s3-app" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "image-manager-app-file"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket_object.bucket-s3-app-war will be created
  + resource "aws_s3_bucket_object" "bucket-s3-app-war" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "beanstalk/ImageManager_v1.war"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "files/ImageManager_v1.war"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
</details>
*Pusher: @acolominas, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*